Terraform plan output:
```
piz@piz-macbookpro:~/Documents/gitrepo/ml-auto-solutions-github/deployment$ terraform plan -lock=false
data.google_client_config.provider: Reading...
google_bigquery_dataset.dataset_setup["benchmark_dataset"]: Refreshing state... [id=projects/cloud-ml-auto-solutions/datasets/benchmark_dataset]
google_bigquery_dataset.dataset_setup["xlml_dataset"]: Refreshing state... [id=projects/cloud-ml-auto-solutions/datasets/xlml_dataset]
google_bigquery_dataset.dataset_setup["dev_benchmark_dataset"]: Refreshing state... [id=projects/cloud-ml-auto-solutions/datasets/dev_benchmark_dataset]
google_bigquery_dataset.dataset_setup["dev_xlml_dataset"]: Refreshing state... [id=projects/cloud-ml-auto-solutions/datasets/dev_xlml_dataset]
google_container_cluster.gpu-uc1: Refreshing state... [id=projects/cloud-ml-auto-solutions/locations/us-central1/clusters/gpu-uc1]
google_project_service.composer_api: Refreshing state... [id=cloud-ml-auto-solutions/composer.googleapis.com]
google_service_account.custom_service_account["ml-automation-solutions-dev"]: Refreshing state... [id=projects/cloud-ml-auto-solutions/serviceAccounts/ml-auto-solutions-dev@cloud-ml-auto-solutions.iam.gserviceaccount.com]
google_service_account.custom_service_account["ml-automation-solutions"]: Refreshing state... [id=projects/cloud-ml-auto-solutions/serviceAccounts/ml-auto-solutions@cloud-ml-auto-solutions.iam.gserviceaccount.com]
data.google_client_config.provider: Read complete after 0s [id=projects/<null>/regions/<null>/zones/<null>]
google_project_iam_member.storage_admin_role["ml-automation-solutions"]: Refreshing state... [id=cloud-ml-auto-solutions/roles/storage.admin/serviceAccount:ml-auto-solutions@cloud-ml-auto-solutions.iam.gserviceaccount.com]
google_project_iam_member.storage_admin_role["ml-automation-solutions-dev"]: Refreshing state... [id=cloud-ml-auto-solutions/roles/storage.admin/serviceAccount:ml-auto-solutions-dev@cloud-ml-auto-solutions.iam.gserviceaccount.com]
google_project_iam_member.big_query_admin_role["ml-automation-solutions"]: Refreshing state... [id=cloud-ml-auto-solutions/roles/bigquery.admin/serviceAccount:ml-auto-solutions@cloud-ml-auto-solutions.iam.gserviceaccount.com]
google_project_iam_member.big_query_admin_role["ml-automation-solutions-dev"]: Refreshing state... [id=cloud-ml-auto-solutions/roles/bigquery.admin/serviceAccount:ml-auto-solutions-dev@cloud-ml-auto-solutions.iam.gserviceaccount.com]
google_project_iam_member.monitoring_viewer_role["ml-automation-solutions"]: Refreshing state... [id=cloud-ml-auto-solutions/roles/monitoring.viewer/serviceAccount:ml-auto-solutions@cloud-ml-auto-solutions.iam.gserviceaccount.com]
google_project_iam_member.monitoring_viewer_role["ml-automation-solutions-dev"]: Refreshing state... [id=cloud-ml-auto-solutions/roles/monitoring.viewer/serviceAccount:ml-auto-solutions-dev@cloud-ml-auto-solutions.iam.gserviceaccount.com]
google_project_iam_member.project_iam_admin_role["ml-automation-solutions-dev"]: Refreshing state... [id=cloud-ml-auto-solutions/roles/resourcemanager.projectIamAdmin/serviceAccount:ml-auto-solutions-dev@cloud-ml-auto-solutions.iam.gserviceaccount.com]
google_project_iam_member.project_iam_admin_role["ml-automation-solutions"]: Refreshing state... [id=cloud-ml-auto-solutions/roles/resourcemanager.projectIamAdmin/serviceAccount:ml-auto-solutions@cloud-ml-auto-solutions.iam.gserviceaccount.com]
google_project_iam_member.composer_worker_role["ml-automation-solutions"]: Refreshing state... [id=cloud-ml-auto-solutions/roles/composer.worker/serviceAccount:ml-auto-solutions@cloud-ml-auto-solutions.iam.gserviceaccount.com]
google_project_iam_member.composer_worker_role["ml-automation-solutions-dev"]: Refreshing state... [id=cloud-ml-auto-solutions/roles/composer.worker/serviceAccount:ml-auto-solutions-dev@cloud-ml-auto-solutions.iam.gserviceaccount.com]
google_project_iam_member.vertex_ai_admin_role["ml-automation-solutions-dev"]: Refreshing state... [id=cloud-ml-auto-solutions/roles/aiplatform.admin/serviceAccount:ml-auto-solutions-dev@cloud-ml-auto-solutions.iam.gserviceaccount.com]
google_project_iam_member.vertex_ai_admin_role["ml-automation-solutions"]: Refreshing state... [id=cloud-ml-auto-solutions/roles/aiplatform.admin/serviceAccount:ml-auto-solutions@cloud-ml-auto-solutions.iam.gserviceaccount.com]
google_project_iam_member.service_account_user_role["ml-automation-solutions"]: Refreshing state... [id=cloud-ml-auto-solutions/roles/iam.serviceAccountUser/serviceAccount:ml-auto-solutions@cloud-ml-auto-solutions.iam.gserviceaccount.com]
google_project_iam_member.service_account_user_role["ml-automation-solutions-dev"]: Refreshing state... [id=cloud-ml-auto-solutions/roles/iam.serviceAccountUser/serviceAccount:ml-auto-solutions-dev@cloud-ml-auto-solutions.iam.gserviceaccount.com]
google_project_iam_member.tpu_admin_role["ml-automation-solutions"]: Refreshing state... [id=cloud-ml-auto-solutions/roles/tpu.admin/serviceAccount:ml-auto-solutions@cloud-ml-auto-solutions.iam.gserviceaccount.com]
google_project_iam_member.tpu_admin_role["ml-automation-solutions-dev"]: Refreshing state... [id=cloud-ml-auto-solutions/roles/tpu.admin/serviceAccount:ml-auto-solutions-dev@cloud-ml-auto-solutions.iam.gserviceaccount.com]
google_service_account_iam_member.custom_service_account["ml-automation-solutions-dev"]: Refreshing state... [id=projects/cloud-ml-auto-solutions/serviceAccounts/ml-auto-solutions-dev@cloud-ml-auto-solutions.iam.gserviceaccount.com/roles/composer.ServiceAgentV2Ext/serviceAccount:service-24860729792@cloudcomposer-accounts.iam.gserviceaccount.com]
google_service_account_iam_member.custom_service_account["ml-automation-solutions"]: Refreshing state... [id=projects/cloud-ml-auto-solutions/serviceAccounts/ml-auto-solutions@cloud-ml-auto-solutions.iam.gserviceaccount.com/roles/composer.ServiceAgentV2Ext/serviceAccount:service-24860729792@cloudcomposer-accounts.iam.gserviceaccount.com]
google_project_iam_member.service_account_admin_role["ml-automation-solutions"]: Refreshing state... [id=cloud-ml-auto-solutions/roles/iam.serviceAccountAdmin/serviceAccount:ml-auto-solutions@cloud-ml-auto-solutions.iam.gserviceaccount.com]
google_project_iam_member.service_account_admin_role["ml-automation-solutions-dev"]: Refreshing state... [id=cloud-ml-auto-solutions/roles/iam.serviceAccountAdmin/serviceAccount:ml-auto-solutions-dev@cloud-ml-auto-solutions.iam.gserviceaccount.com]
google_project_iam_member.compute_instance_admin_role["ml-automation-solutions"]: Refreshing state... [id=cloud-ml-auto-solutions/roles/compute.instanceAdmin.v1/serviceAccount:ml-auto-solutions@cloud-ml-auto-solutions.iam.gserviceaccount.com]
google_project_iam_member.compute_instance_admin_role["ml-automation-solutions-dev"]: Refreshing state... [id=cloud-ml-auto-solutions/roles/compute.instanceAdmin.v1/serviceAccount:ml-auto-solutions-dev@cloud-ml-auto-solutions.iam.gserviceaccount.com]
module.composer["ml-automation-solutions-dev"].google_composer_environment.example_environment: Refreshing state... [id=projects/cloud-ml-auto-solutions/locations/us-central1/environments/ml-automation-solutions-dev]
module.composer["ml-automation-solutions"].google_composer_environment.example_environment: Refreshing state... [id=projects/cloud-ml-auto-solutions/locations/us-central1/environments/ml-automation-solutions]
google_project_iam_member.artifact_registry_admin_role["ml-automation-solutions"]: Refreshing state... [id=cloud-ml-auto-solutions/roles/artifactregistry.admin/serviceAccount:ml-auto-solutions@cloud-ml-auto-solutions.iam.gserviceaccount.com]
google_project_iam_member.artifact_registry_admin_role["ml-automation-solutions-dev"]: Refreshing state... [id=cloud-ml-auto-solutions/roles/artifactregistry.admin/serviceAccount:ml-auto-solutions-dev@cloud-ml-auto-solutions.iam.gserviceaccount.com]
google_bigquery_table.table_setup["xlml_dataset-metadata_history"]: Refreshing state... [id=projects/cloud-ml-auto-solutions/datasets/xlml_dataset/tables/metadata_history]
google_bigquery_table.table_setup["dev_benchmark_dataset-metric_history"]: Refreshing state... [id=projects/cloud-ml-auto-solutions/datasets/dev_benchmark_dataset/tables/metric_history]
google_bigquery_table.table_setup["benchmark_dataset-job_history"]: Refreshing state... [id=projects/cloud-ml-auto-solutions/datasets/benchmark_dataset/tables/job_history]
google_bigquery_table.table_setup["benchmark_dataset-metric_history"]: Refreshing state... [id=projects/cloud-ml-auto-solutions/datasets/benchmark_dataset/tables/metric_history]
google_bigquery_table.table_setup["dev_benchmark_dataset-metadata_history"]: Refreshing state... [id=projects/cloud-ml-auto-solutions/datasets/dev_benchmark_dataset/tables/metadata_history]
google_bigquery_table.table_setup["dev_xlml_dataset-metric_history"]: Refreshing state... [id=projects/cloud-ml-auto-solutions/datasets/dev_xlml_dataset/tables/metric_history]
google_bigquery_table.table_setup["xlml_dataset-job_history"]: Refreshing state... [id=projects/cloud-ml-auto-solutions/datasets/xlml_dataset/tables/job_history]
google_bigquery_table.table_setup["dev_xlml_dataset-job_history"]: Refreshing state... [id=projects/cloud-ml-auto-solutions/datasets/dev_xlml_dataset/tables/job_history]
google_bigquery_table.table_setup["benchmark_dataset-metadata_history"]: Refreshing state... [id=projects/cloud-ml-auto-solutions/datasets/benchmark_dataset/tables/metadata_history]
google_bigquery_table.table_setup["dev_benchmark_dataset-job_history"]: Refreshing state... [id=projects/cloud-ml-auto-solutions/datasets/dev_benchmark_dataset/tables/job_history]
google_bigquery_table.table_setup["xlml_dataset-metric_history"]: Refreshing state... [id=projects/cloud-ml-auto-solutions/datasets/xlml_dataset/tables/metric_history]
google_bigquery_table.table_setup["dev_xlml_dataset-metadata_history"]: Refreshing state... [id=projects/cloud-ml-auto-solutions/datasets/dev_xlml_dataset/tables/metadata_history]
google_container_node_pool.primary: Refreshing state... [id=projects/cloud-ml-auto-solutions/locations/us-central1/clusters/gpu-uc1/nodePools/primary-pool]
google_container_node_pool.nvidia-v100x2: Refreshing state... [id=projects/cloud-ml-auto-solutions/locations/us-central1/clusters/gpu-uc1/nodePools/nvidia-v100x2-pool]
kubernetes_service.example: Refreshing state... [id=default/headless-svc]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_container_node_pool.nvidia-v100x2 must be replaced
-/+ resource "google_container_node_pool" "nvidia-v100x2" {
      ~ id                          = "projects/cloud-ml-auto-solutions/locations/us-central1/clusters/gpu-uc1/nodePools/nvidia-v100x2-pool" -> (known after apply)
      ~ initial_node_count          = 3 -> (known after apply)
      ~ instance_group_urls         = [
          - "https://www.googleapis.com/compute/v1/projects/cloud-ml-auto-solutions/zones/us-central1-b/instanceGroupManagers/gke-gpu-uc1-nvidia-v100x2-pool-ec39c8e8-grp",
        ] -> (known after apply)
      ~ managed_instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/cloud-ml-auto-solutions/zones/us-central1-b/instanceGroups/gke-gpu-uc1-nvidia-v100x2-pool-ec39c8e8-grp",
        ] -> (known after apply)
      + max_pods_per_node           = (known after apply)
        name                        = "nvidia-v100x2-pool"
      + name_prefix                 = (known after apply)
      ~ node_count                  = 2 -> (known after apply)
      + operation                   = (known after apply)
      ~ version                     = "1.29.4-gke.1165000" -> (known after apply)
        # (4 unchanged attributes hidden)

      ~ autoscaling {
          ~ location_policy      = "ANY" -> (known after apply)
          - total_max_node_count = 0 -> null
          - total_min_node_count = 0 -> null
            # (2 unchanged attributes hidden)
        }

      - network_config {
          - create_pod_range     = false -> null
          - enable_private_nodes = false -> null
        }

      ~ node_config {
          ~ disk_size_gb      = 100 -> 500 # forces replacement
          ~ guest_accelerator = [
              ~ {
                  - gpu_partition_size             = ""
                  - gpu_sharing_config             = []
                    # (3 unchanged attributes hidden)
                },
            ]
          ~ image_type        = "COS_CONTAINERD" -> (known after apply)
          ~ labels            = {} -> (known after apply)
          ~ local_ssd_count   = 0 -> (known after apply)
          ~ metadata          = {
              - "disable-legacy-endpoints" = "true"
            } -> (known after apply)
          + min_cpu_platform  = (known after apply)
          - resource_labels   = {} -> null
          ~ service_account   = "default" -> (known after apply)
          - tags              = [] -> null
          ~ taint             = [] -> (known after apply)
            # (6 unchanged attributes hidden)

          + ephemeral_storage_local_ssd_config { # forces replacement
              + local_ssd_count = 2 # forces replacement
            }

          - shielded_instance_config {
              - enable_integrity_monitoring = true -> null
              - enable_secure_boot          = false -> null
            }
        }

      - upgrade_settings {
          - max_surge       = 1 -> null
          - max_unavailable = 0 -> null
          - strategy        = "SURGE" -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if you run "terraform apply" now.
```